<HTML>
<HEAD>
<TITLE>Yhteydenotot</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: author.html 1.6 2017/04/06 23:34:18 wepl Exp wepl $ --></HEAD>
<BODY>
<h4><a name="Contact">Yhteystiedot</a></h4>
<table cellpadding=5>
<tr><td>S&auml;hk&ouml;posti</td><td><a href="mailto:wepl@whdload.de">wepl@whdload.de</a><td></tr><tr><td>Kotisivu</td><td><a href="http://www.whdload.de/wepl/">http://www.whdload.de/wepl/</a><td></tr><tr><td>WHDLoadin kotisivu</td><td><a href="http://www.whdload.de/">http://www.whdload.de/</a><td></tr><tr><td valign=top>Postiosoite</td><td>
<address>Bert Jahn<br> Samuel-Heinicke-Stra&szlig;e 13<br> Zwickau<br> 08058<BR> Saksa</address>
</td></tr>
</table>
<h4>Tietoja tekij&auml;st&auml;</h4>T&auml;ss&auml; on hieman tietoa minusta sek&auml; WHDLoadin historiasta. <br>Kouluaikana tutustuin ensimm&auml;ist&auml; kertaa elektroniikkaan. Veljeni, joka on useita vuosia minua vanhempi, on rakentanut useita elektronisia laitteita. Se teki minuun vaikutuksen ja aloin tehd&auml; samaa. Rakensin (tai yritin rakentaa) erilaisia elektronisia laitteita, vilkkuvista LED-valoista aina vahvistimiin asti. My&ouml;hemmin tietokoneista tuli suosittuja ja p&auml;&auml;sin k&auml;ytt&auml;m&auml;&auml;n KC85-nimist&auml; tietokonetta. Toivoin voivani omistaa oman tietokoneen, mutta se ei ollut tuolloin mahdollista rahatilanteen vuoksi sek&auml; siksi, ettei niit&auml; ollut It&auml;-Saksassa edes saatavana. Aloin siis rakentaa tietokonetta saksalaisen Funkamateur-lehden piirustusten mukaisesti. T&auml;m&auml;n ty&ouml;n aikana Saksassa alkoivat poliittiset muutokset, jotka johtivat maiden yhdistymiseen. Ne tekiv&auml;t rakennusprojektistani vanhentuneen, joten lopetin ty&ouml;ni sen parissa. Sain yst&auml;v&auml;lt&auml;ni vanhan CBM 3032 -koneen ja aloitin ohjelmoinnin sill&auml;. Ensin Basic-kielell&auml; ja my&ouml;hemmin (nopeussyist&auml;) konekielell&auml;. Kirjoitin mukavan Backgammon-ohjelman sek&auml; nopean Game of Life (Cromwell) -simulaattorin. V&auml;h&auml;n my&ouml;hemmin vuonna 1990 ostin ensimm&auml;isen Amigani, A500:n. Minulla oli hauskaa ensimm&auml;isten pelieni parissa: Corporationin ja RoboCop 2:n T&auml;ll&ouml;i k&auml;ytin Amigaa l&auml;hinn&auml; pelaamiseen. My&ouml;hemmin hankin Action Replay III:n, jotta voisin tutustua Amigan laitteistoon ja muokata ohjelmistoa omaan k&auml;ytt&ouml;&ouml;ni sopivaksi. Saadakseni kiintolevyn myin sitten A500:n ja hankin A2000:n, jota my&ouml;hemmin laajensin GVP G-Force 030/25:ll&auml;. Omistan t&auml;m&auml;n koneen edelleen, vaikken en&auml;&auml; k&auml;yt&auml; sit&auml; kovinkaan paljon. Aloitin assembler-ohjelmoinnin ja kirjoitin muutamia pieni&auml; ty&ouml;kaluja, joista tunnetuin lienee WRip. Jouluna 1994 ohjelmoin WHDLoadin ensimm&auml;iset tavut. Syy oli Cannon Fodder 2, joka oli ep&auml;pelattava levykkeilt&auml;. Olin aiemmin n&auml;hnyt TLC:n tekem&auml;n kiintolevyasentajan Agony-pelille, ja se teki vaikutuksen. Mietin miten t&auml;m&auml; toimi, sill&auml; peli ei toiminut k&auml;ytt&ouml;j&auml;rjestelm&auml;n alla mutta asennusohjelma luki tiedostot kiintolevylt&auml;. Tutkittuani asiaa tarkemmin ymm&auml;rsin sen toimintaperiaatteen ja aloin laatia jotakin samanlaista CF2:lle. Koodi lojui pitk&auml;&auml;n muuttamattomana kiintolevyll&auml;ni. Helmikuussa 1996 otin sen j&auml;lleen ty&ouml;n alle. Keksin idean ohjelmasta, joka sis&auml;lt&auml;&auml; kaikki tekniset osat ominaisuuksien alentamiseen ja k&auml;ytt&ouml;j&auml;rjestelm&auml;n vaihtoon, kirjaston tapaan. Sek&auml; toisesta koodiosasta (Slave), joka sis&auml;lt&auml;&auml; asennettavaa ohjelmaa koskevat tiedot. N&auml;in WHDLoad syntyi. Ty&ouml;skentelin WHDLoadin parissa s&auml;&auml;nn&ouml;llisemmin. Kirjoitin asennusohjelmat Godsille ja Chaos Enginelle, ja elokuussa 1996 Aminetiin l&auml;hetettiin ensimm&auml;inen julkinen WHDLoad-versio (0.43). En saanut siit&auml; paljonkaan palautetta, mutta jatkoin WHDLoadin ty&ouml;st&auml;mist&auml;. Toteutin lis&auml;&auml; ominaisuuksia ja poistin bugeja. Vuoden 1997 alussa loin ensimm&auml;isen WWW-sivun WHDLoadille. Huhtikuussa 1997 sain ensimm&auml;iset yhteydenotot ihmisilt&auml;, jotka halusivat kirjoittaa asennusohjelmia WHDLoadin avulla. He olivat Harry ja Mr. Larmer. T&auml;m&auml; oli minulle iloinen hetki. Ajan mittaan WHDLoad-projekti kasvoi entisest&auml;&auml;n. Lis&auml;&auml; ominaisuuksia, parempi yhteensopivuus ja useita eri ihmisten tekemi&auml; uusia asennusohjelmia. <br>Nyky&auml;&auml;n WHDLoad on eritt&auml;in vakaa ja siin&auml; on paljon ominaisuuksia. Sen kirjoittaminen, testaaminen ja bugikorjaukset ovat vaatineet paljon vaivaa ja aikaa. Uskon, ett&auml; monikaan ei voi kuvitella, miten paljon tarkalleen &ndash; erityisesti, koska useimpia WHDLoadin osia on todella hankala debugata. Pyyt&auml;m&auml;ll&auml; rekister&ouml;intimaksua WHDLoadin versiosta 1.0 alkaen olen toivonut pient&auml; tukea ja korvausta t&auml;st&auml; vaivasta. Maksusta saavat osansa my&ouml;s muiden WHDLoad-asennusohjelmien tekij&auml;t. <br>Toivottavasti sin&auml;kin haluat tukea WHDLoadin ja uusien asennusohjelmien tulevaisuutta. Toteutetaan yhdess&auml; unelma, ett&auml; jonakin p&auml;iv&auml;n&auml; ei ole en&auml;&auml; pelej&auml;, jotka on hyl&auml;tty levykkeille, koska niille ei ole asennusohjelmaa...<p>2014-11-01: Nyt julkaisun 18.0 kynnyksell&auml; haluan katsahtaa hieman taaksep&auml;in. Projekti on ollut k&auml;ynniss&auml; vuosikaudet ja ty&ouml;skentelen yh&auml; WHDLoadin, verkkosivuston ja asennusohjelmien parissa. Eritt&auml;in aktiiviset projektin osallistujat kirjoittavat ja p&auml;ivitt&auml;v&auml;t edelleen asennuspaketteja, mist&auml; heille kuuluu kiitos! Ihmiset my&ouml;s rekister&ouml;iv&auml;t ohjelmaa edelleen, vaikka perinteinen Amiga on jo vahvasti retrotietokone. Olen tyytyv&auml;inen siit&auml;, ett&auml; kaikki toimii. Vaikuttaa silt&auml;, ett&auml; WHDLoadista on edelleen hy&ouml;ty&auml; ihmisille ja ett&auml; sill&auml; voi muistella aikaa, joka oli tavallaan my&ouml;s minun nuoruuttani. T&auml;ytyy my&ouml;nt&auml;&auml;, ett&auml; ajoittain olen kysynyt itselt&auml;ni, onko WHDLoadiin k&auml;ytetty aika ollut hy&ouml;dyllist&auml;. Ehk&auml; jotain nyt tekem&auml;tt&auml; j&auml;&auml;nytt&auml; olisikin kannattanut tehd&auml;. El&auml;m&auml; kuitenkin kulkee radallaan, joten pit&auml;&auml; voida tehd&auml; p&auml;&auml;t&ouml;ksi&auml; yksi kerrallaan ja hyv&auml;ksy&auml; se, ett&auml; my&ouml;hemmin asioita voi joutua katumaan. Mahdollisuuksia t&auml;ysin erilaisten asioiden tekemiseen on v&auml;h&auml;n, mutta pyrin kuitenkin tarttumaan my&ouml;s niihin ja jatkamaan edelleen ty&ouml;t&auml; WHDLoadin parissa.</BODY>
</HTML>
