<HTML>
<HEAD>
<TITLE>Bugit</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: bugs.html 1.7 2019/02/21 00:41:00 wepl Exp wepl $ --></HEAD>
<BODY>
<h3>Tuntemattomat bugit</h3>Jos havaitset uusia bugeja tai haluat raportoida muista ongelmista, k&auml;yt&auml; bugity&ouml;kalua osoitteessa <a
href="http://mantis.whdload.de/search.php?project_id=4&hide_status_id=-2">http://mantis.whdload.de</a>.<h3>Tunnetut bugit</h3>
<h4>Yleiset ongelmat</h4>
<ul>
<li>Yleinen ongelma liittyy Amigaan kytkettyyn laitteistoon, joka synnytt&auml;&auml; keskeytyksi&auml; satunnaisesti tai s&auml;&auml;nn&ouml;llisesti. Esimerkkin&auml; on verkkokorttini (Hydra). Jos TCP/IP-pino on k&auml;ynniss&auml;, l&auml;hes jokainen ohjelma hyytyy hetken kuluttua, koska kortti luo PORTS-keskeytyksi&auml; (samanlaisia kuin n&auml;pp&auml;imist&ouml;), joihin asennettu ohjelma ei osaa vastata oikein. T&auml;m&auml; johtuu siit&auml;, ett&auml; heti kun pyynt&ouml; on kuitattu rte:ll&auml;, tulee seuraava keskeytys. Ongelman v&auml;ltt&auml;miseksi on TCP/IP-pino pys&auml;ytett&auml;v&auml; <a
href="opt.html#ExecuteStartup">ennen</a> WHDLoadin k&auml;ynnistyst&auml;.<br> Sama koskee USB-pinoja (k&auml;yt&auml; Poseidonille k&auml;sky&auml; &quot;AddUSBHardware REMOVE ALL&quot;) sek&auml; Mediator-korttien Voodoo-keskeytyst&auml; (aseta &quot;VoodooInt = No&quot;). WHDLoad-versiosta 16.8 alkaen Mediator-korttien tekemille keskeytyksille on sis&auml;&auml;nrakennettu kiertotie, joten erityisasetuksia ei tarvita.<br> Julkaisua 1.36 tai sit&auml; uudempia Picasso96-versioita k&auml;ytett&auml;ess&auml; my&ouml;s Spectrum-n&auml;ytt&ouml;kortti synnytt&auml;&auml; ko. keskeytyksi&auml;. T&auml;m&auml;n v&auml;ltt&auml;miseksi Picasso96-ohjelmisto on palautettava 1.36:tta edelt&auml;v&auml;&auml;n versioon tai gfxcard-ohjain on kytkett&auml;v&auml; pois.<li>Jos saat virheit&auml; koskien tiedostojen lukua tai kirjoitusta, tarkista ett&auml; kiintolevysi on m&auml;&auml;ritetty oikein. WHDLoad lukee dataa suurissa lohkoissa (&gt;1 Mt), mik&auml; tuo helposti esiin kokoonpanon ongelmat, vaikka muut sovellukset vaikuttaisivat toimivan. Varmista siis, ett&auml; asetusten MaxTransfer ja Mask arvot HDToolBoxissa on asetettu oikein kaikille partitioille. Turvallinen arvo (heikosti toimivalle laitteistolle) on MaxTransfer = 0x7FEC ja Mask = 0x7FFFFC. T&auml;m&auml; koskee erityisesti PCMCIA-korttipaikkaan liitettyj&auml; laitteita ja IDE-CF-korttisovittimia.<br> Toinen ongelmien syy voivat olla muistivaraukset. Tietyill&auml; kokoonpanoilla on ongelmia k&auml;&auml;nteisten muistivarausten kanssa. T&auml;ss&auml; tapauksessa WHDLoad voidaan pakottaa olemaan k&auml;ytt&auml;m&auml;tt&auml; Reverse-tilaa asettamalla valinta <a
href="opt.html#NoMemReverse">NoMemReverse</a>.<li>Jos k&auml;yt&auml;t Picasso96-ohjelmistoa, varmista, ett&auml; FakeNativeModes-valinta on arvossa NO (n&auml;yt&ouml;n ajurin tooltype). Muuten tuloksena on grafiikkavirheit&auml; ja mahdollisia kaatumisia.<li>Jotkin harvinaiset laitteistokokoonpanot eiv&auml;t tue WHDLoadin MMU-ominaisuuksia. T&auml;m&auml; vaikuttaa ainoastaan 68030-pohjaisiin j&auml;rjestelmiin. Valintaa <a href="opt.html#MMU">MMU/S</a> ei tule k&auml;ytt&auml;&auml; n&auml;iss&auml; j&auml;rjestelmiss&auml;! Jos valinta on k&auml;yt&ouml;ss&auml;, WHDLoad pys&auml;ytt&auml;&auml; koko koneen. T&auml;ll&auml; hetkell&auml; tiedet&auml;&auml;n, ett&auml; ongelmia aiheuttavat seuraavat laitteet: &quot;Apollo A630&quot;, &quot;Apollo 1230&quot;, &quot;Elbox 1230&quot; ja &quot;Magnum MK2&quot;.<li>A1200:n PCMCIA-portin RAM-laajennusten kanssa vaikuttaa olevan ongelmia. WHDLoad saattaa antaa virheit&auml; kuten <tt>Dos error #235 (executable not valid) on loading &quot;xxx.slave&quot;</tt>. Syyn&auml; vaikuttaa olevan, ett&auml; muisti on sidottu v&auml;&auml;rin j&auml;rjestelm&auml;n muistiluetteloon, koska WHDLoad yritt&auml;&auml; varata muistia MEMF_REVERSE -lipulla ja saa v&auml;&auml;r&auml;n paluuarvon (osoitin olemattomaan muistiin). Ei ole tiedossa, tapahtuuko t&auml;t&auml; vain tiettyjen korttien tai laitteistokokoonpanojen kanssa.</ul>
<h4>Kehitykseen liittyv&auml;&auml;</h4>
<ul>
<li>K&auml;ytt&ouml;j&auml;rjestelm&auml;n ja asennetun ohjelman v&auml;lill&auml; vaihtaminen ei ole t&auml;ysin luotettavaa. Ongelmana on, ett&auml; useimpia Custom-rekistereit&auml; ja joitakin CIA-rekistereit&auml; ei voi lukea, eik&auml; niit&auml; siten voi tallentaa ja palauttaa. WHDLoad ei itse muuta n&auml;it&auml; rekistereit&auml;, mutta kun se vaihtaa asennetusta ohjelmasta k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n (esim. ladatakseen tiedoston levylt&auml;), k&auml;ytt&ouml;j&auml;rjestelm&auml; voi vaihtaa jotakin n&auml;ist&auml; rekistereist&auml;, joita ei voi palauttaa. Jos asennettu ohjelma vaatii, ett&auml; kaikki rekisterit s&auml;ilyv&auml;t muuttamattomina, t&auml;st&auml; seuraa ongelmia. Tiedet&auml;&auml;n, ett&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml; muuttaa ainakin rekistereit&auml; cop2lc, bltafwm ja bltalwm sek&auml; kenties muita. Ongelman voi kiert&auml;&auml; mahdollisuudella palauttaa muutetut rekisterit vaihdon aikana. Lis&auml;tietoja on kohdassa <A HREF="../autodoc.html#WHDLTAG_CBSWITCH_SET">WHDLTAG_CBSWITCH_SET</A>.</ul>
</BODY>
</HTML>
