<HTML>
<HEAD>
<TITLE>Suorittimen v&auml;limuistin k&auml;sittely</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: cache.html 1.4 2014/12/04 23:37:38 wepl Exp wepl $ --></HEAD>
<BODY>
<h3>Suorittimen v&auml;limuistin yleiskatsaus</h3>Suorituskyky&auml; parantaakseen jotkin 68k-perheen suorittimet osaavat tallentaa muistihakuja v&auml;limuistiin. <br>V&auml;limuistiin viitataan aina loogisella osoitteella, sis&auml;lt&auml;en haun funktiokoodin. T&auml;m&auml; tarkoittaa, ett&auml; User- ja Supervisor-tilan haut tuottavat erilaiset v&auml;limuistikirjaukset (lis&auml;tietoa Motorolan ohjekirjoista).<p>Seuraavassa on yleiskatsaus 68k-suoritinten v&auml;limuistikyvyist&auml;:<ul><li>68000 ei mit&auml;&auml;n<li>68010<ul>
<li>Instruction Prefetch <br>kaksi sanaa (word) esihaku, yksi sana dekoodausrekisteri<li>Loop Mode <br> -tilaan siirryt&auml;&auml;n, kun yhden sanan k&auml;sky&auml; seuraa edelliseen k&auml;skyyn palautuva DBcc, ei k&auml;skyhakuja ennen silmukan p&auml;&auml;ttymist&auml;</ul><li>68020<ul>
<li>Instruction Prefetch <br>yksi long word<li>Instruction Cache <br>16 rivi&auml; &aacute; 16 tavua = 256 tavua <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n tai j&auml;&auml;dytt&auml;&auml; CACR:n kautta</ul><li>68030<ul>
<li>Instruction Prefetch <br>yksi long word<li>Instruction Cache <br>16 rivi&auml; &aacute; 16 tavua = 256 tavua <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n tai j&auml;&auml;dytt&auml;&auml; CACR:n kautta <br>Burst-tila pakottaa lukemaan koko v&auml;limuistirivit kerralla, jos laitteisto tukee sit&auml;<li>Data Cache <br>16 rivi&auml; &aacute; 16 tavua = 256 byte <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n tai j&auml;&auml;dytt&auml;&auml; CACR:n kautta <br>aina WriteThrough <br>valittava Write Allocation -tila, jolla voidaan pakottaa muut k&auml;ytt&auml;j&auml;-/supervisor-tilassa tehdyt kirjoitusoperaatiot hyl&auml;tt&auml;viksi <br>Burst-tila pakottaa lukemaan koko v&auml;limuistirivit kerralla, jos laitteisto tukee sit&auml;</ul><li>68040<ul>
<li>Instruction Prefetch <br>yksi long word<li>Instruction Cache <br>256 rivi&auml; &aacute; 16 tavua = 4096 tavua <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n CACR:n kautta<li>Data Cache <br>256 rivi&auml; &aacute; 16 tavua = 4096 tavua <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n tai j&auml;&auml;dytt&auml;&auml; CACR:n kautta <br>valittavana tilat CopyBack/WriteThrough MMU:n kautta</ul><li>68060<ul>
<li>Instruction Prefetch <br>yksi long word<li>Instruction Cache <br>512 rivi&auml; &aacute; 16 tavua = 8192 tavua <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n, j&auml;&auml;dytt&auml;&auml; tai pienent&auml;&auml; puoleen kokoon CACR:n kautta<li>Branch Cache <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n CACR:n kautta <br>MMU-asetus ei vaikuta!<li>Superscalar Dispatch <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n CACR:n kautta<li>Data Cache <br>512 rivi&auml; &aacute; 16 tavua = 8192 tavua <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n, j&auml;&auml;dytt&auml;&auml; tai pienent&auml;&auml; puoleen kokoon CACR:n kautta <br>valittavana tilat CopyBack/WriteThrough MMU:n kautta<li>Push Buffer <br>voidaan kytke&auml; pois PCR:n kautta<li>Store Buffer <br>voidaan ottaa k&auml;ytt&ouml;&ouml;n CACR:n kautta <br>Sivujen oltava NonCachable Serialized (tarkka)</ul></ul>
<h4><a name="cache">V&auml;limuistin hallinta WHDLoadissa</a></h4>Ensimm&auml;inen t&auml;rke&auml; asia on ymm&auml;rt&auml;&auml; se, ett&auml; 68030&ndash;68060:ss&auml; v&auml;limuisteja ohjaavat Cache Control Register (CACR) <b>ja</b> MMU! <br>CACR:ss&auml; v&auml;limuistit otetaan yleisesti k&auml;ytt&ouml;&ouml;n tai pois k&auml;yt&ouml;st&auml;. MMU:ta k&auml;ytett&auml;ess&auml; yksitt&auml;isten sivujen (WHDLoadissa 4 Kt) kohdalle merkit&auml;&auml;n, miten ne voi tallentaa v&auml;limuistiin. <br>68030:ss&auml; muistisivu voi olla Cacheable tai NotCacheable. 68040/68060:ss&auml; se voi olla tallennettavissa WriteThrough-v&auml;limuistiin, tallennettavissa CopyBack-v&auml;limuistiin, NonCachable (ep&auml;tarkka) tai NonCachable Serialized (tarkka). <br>Jos WHDLoad ei k&auml;yt&auml; MMU:ta, se ohjaa vain CACR:&auml;&auml;.<h4>V&auml;limuistin oletusasetukset</h4>WHDLoadin alueet, Slave sek&auml; ExpMem on oletuksena merkitty tallennettaviksi CopyBack-v&auml;limuistiin. BaseMem-alue on merkitty tilaan NonCachable ja CACR:st&auml; on otettu k&auml;ytt&ouml;&ouml;n Data ja Instruction Cache. N&auml;in BaseMem-alueella sijaitseva ohjelma suoritetaan ilman v&auml;limuistia, mutta WHDLoad, Slave ja ExpMem k&auml;ytt&auml;v&auml;t v&auml;limuistia suorituskyvyn parantamiseksi. Jos MMU ei ole WHDLoadin k&auml;yt&ouml;ss&auml;, t&auml;m&auml; asetus kytkee molemmat v&auml;limuistit pois, koska ilman MMU:ta eri muistialueille ei voida tehd&auml; erilaisia asetuksia; jos jokin alue on merkitty tilaan NonCacheable, on kaikki v&auml;limuistit kytkett&auml;v&auml; pois.<h4>Ohjelmoijan v&auml;limuistin ohjaus</h4> V&auml;limuistien ohjaukseen on kaksi resload-funktiota: <A HREF="../autodoc.html#resload_SetCACR">resload_SetCACR</a> ja <A HREF="../autodoc.html#resload_SetCPU">resload_SetCPU</a>. N&auml;ist&auml; <a
href="../autodoc.html#resload_SetCACR">resload_SetCACR</a> on vanhempi rutiini, joka voidaan t&auml;ysin korvata <a
href="../autodoc.html#resload_SetCPU">resload_SetCPU</a>:lla (WHDLoad kohdistaa <a
href="../autodoc.html#resload_SetCACR">resload_SetCACR</a>:n argumentit sis&auml;isesti ja kutsuu <a
href="../autodoc.html#resload_SetCPU">resload_SetCPU</a>:ta). Joka tapauksessa r<a href="../autodoc.html#resload_SetCACR">resload_SetCACR</a>:n k&auml;ytt&ouml;&auml; suositellaan kaikille, jotka eiv&auml;t tied&auml; kaikkea v&auml;limuisteista ja niiden k&auml;yt&ouml;ksest&auml; Amiga-j&auml;rjestelm&auml;ss&auml;. K&auml;ytt&auml;m&auml;ll&auml; <a href="../autodoc.html#resload_SetCACR">resload_SetCACR</a>:&auml;&auml; voidaan instruction- ja data-v&auml;limuistit kytke&auml; p&auml;&auml;lle tai pois erikseen. Funktio <a
href="../autodoc.html#resload_SetCACR">resload_SetCACR</a> vaikuttaa vain BaseMem-alueen v&auml;limuistiin tallennettavuuteen.<h4>K&auml;ytt&auml;j&auml;n v&auml;limuistin ohjaus</h4>Jos ohjelmoija on ty&ouml;skennellyt selke&auml;sti, k&auml;ytt&auml;j&auml;n ei tarvitse tehd&auml; v&auml;limuisteille mit&auml;&auml;n, sill&auml; Slave tekee kaikki tarvittavat asetukset. <br>V&auml;limuistin asetusten muuttamiseen k&auml;sin saattaa kuitenkin olla kaksi syyt&auml;. Joko liian nopeasti toimivan asennusohjelman korjaaminen (esim. synnytt&auml;&auml; grafiikkavirheit&auml;) tai asennetun ohjelman toiminnan nopeuttaminen.<p>Jos ohjelma kaatuu, se voidaan saada toimimaan <a
href="opt.html#NoCache">NoCache</a>-valinnalla. T&auml;m&auml; valinta poistaa kaikki v&auml;limuistit ja merkitsee kaiken muistin tilaksi NonCachable Serialized (tarkka). Jos koneessa on 32-bittist&auml; Chip-muistia, se on edelleen nopeampi kuin alkuper&auml;inen A500.<p>Asennetun ohjelman toimintaa voidaan nopeuttaa asettamalla valintoja, jotka ottavat v&auml;limuistit k&auml;ytt&ouml;&ouml;n. T&auml;m&auml; ylikirjoittaa Slaven asetukset. 68020-suorittimella voidaan asettaa valinta <a href="opt.html#Cache">Cache</a>. 68030:ll&auml; voidaan k&auml;ytt&auml;&auml; valintaa <a
href="opt.html#DCache">DCache</a>, joka sis&auml;lt&auml;&auml; my&ouml;s valinnan Cache. 68060:ll&auml; on lis&auml;valintoja: <a href="opt.html#BranchCache">BranchCache</a>, <a href="opt.html#StoreBuffer">StoreBuffer</a> ja <a href="opt.html#SuperScalar">SuperScalar</a>. Valinta <a
href="opt.html#ChipNoCache">ChipNoCache/S</a> voi parantaa suorituskyky&auml; 68040- ja 68060-suorittimilla, ks. alla. <a name="chipmem"></a><h4>Chip-muistin kopiointi v&auml;limuistiin</h4>Kopioitavuuden v&auml;limuistiin voi asettaa, paitsi suoritin itse (CACR) ja MMU, my&ouml;s ulkoinen laitteisto. Suoritin viestitt&auml;&auml; v&auml;yl&auml;&auml; pitkin, jos se yritt&auml;&auml; kopioida toimenpiteen v&auml;limuistiin. Ulkoinen laite voi ilmoittaa suorittimelle (kun osoite on asetettu osoitev&auml;yl&auml;&auml;n muistin k&auml;yt&ouml;n aikana), ett&auml; toimenpidett&auml; ei saa kopioida v&auml;limuistiin. <br>Mekanismia, jolla laitteisto ilmoittaa suorittimelle, onko muisti kopioitavissa v&auml;limuistiin ei (tiet&auml;&auml;kseni) k&auml;ytet&auml; kaikissa Amigoissa ja suoritinkorteissa, joiden suoritin &gt;= 68030 (koska niiss&auml; on datav&auml;limuisti). Vaikutusaluetta ovat koko Chip-muisti ja IO-avaruus (CIA/Custom/RTC), joita ei saa kopioida datav&auml;limuistiin. T&auml;m&auml; on tarpeen, jotta v&auml;ltet&auml;&auml;n v&auml;limuistin ep&auml;jatkuvuudet DMA-toiminnan tai laitteiston rekisterien muuttumisen vuoksi. <br>Suorittimen reagointi siihen, ett&auml; laitteisto est&auml;&auml; kopioinnin v&auml;limuistiin, vaihtelee eri suorittimien v&auml;lill&auml;. 68030:ll&auml; kutsun nopeus ei muutu; tietoja ei vain tallenneta v&auml;limuistiin. 68040:ll&auml; lukutoiminnot tehd&auml;&auml;n t&auml;ydell&auml; nopeudella, mutta kirjoitukset (CopyBack) peruutetaan ja aloitetaan uudestaan ilman v&auml;limuistia, jolloin toiminnot ovat noin 5 kertaa hitaampia (riippuen laitteistosta ja suoritusnopeudesta) kuin ilman v&auml;limuistia. 68060:ll&auml; luku- ja kirjoitustoiminnot peruutetaan ja k&auml;ynnistet&auml;&auml;n uudelleen. Luku on noin 3 kertaa hitaampaa ja kirjoitus noin 5 kertaa hitaampaa. <br>Mainitut asiat liittyv&auml;t datan k&auml;sittelyyn. K&auml;skyjen k&auml;sittely ei yleens&auml; muutu ja se voidaan kopioida v&auml;limuistiin my&ouml;s Chip-muistissa. Jotkin (mahdollisesti rikkin&auml;iset) laitteistot eiv&auml;t salli k&auml;skyjen kopiointia v&auml;limuistiin Chip-muistissa. T&auml;llaisilla laitteilla tulee k&auml;ytt&auml;&auml; <a
href="opt.html#ChipNoCache">ChipNoCache/S</a>-valintaa, jotta estet&auml;&auml;n suoritusnopeuden merkitt&auml;v&auml; hidastuminen, sill&auml; muuten k&auml;skyjen k&auml;sittely on noin 2 kertaa hitaampaa. <br>Voit tarkistaa toiminnan suorittamalla <i>Speed.Slave</i>-tiedoston, joka on kehitt&auml;j&auml;paketin <tt>src/memory-speed</tt> -hakemistossa.<h4>Burst-tila</h4> 68030:n Burst-tila k&auml;skee suorittimen lukea aina t&auml;yden v&auml;limuistirivin (16 tavua) v&auml;limuistin ohituksen j&auml;lkeen, eik&auml; vain pyydetty&auml; long wordia. Laitteiston pit&auml;&auml; tukea Burst-tilaa; jos n&auml;in ei ole, Burst-toimintoa ei suoriteta, eik&auml; t&auml;st&auml; tule aikaseuraamusta. Burst-tila voidaan ottaa erikseen k&auml;ytt&ouml;&ouml;n instruction- ja data-v&auml;limuisteille. Koska Burst-kutsu kest&auml;&auml; kauemman kuin yksitt&auml;inen kutsu, Burst-tilasta on hy&ouml;ty&auml; vain, jos useimmat v&auml;limuistirivin kirjaukset k&auml;ytet&auml;&auml;n ennen kuin v&auml;limuistirivi tyhjenee. Burst-tila parantaa yleens&auml; instruction-v&auml;limuistin suorituskyky&auml;. Data-v&auml;limuistin suorituskyky paranee vain tilanteissa, joissa tehd&auml;&auml;n per&auml;kk&auml;isi&auml; muistin lukuja. Versiosta 18.10 alkaen WHDLoad ottaa instruction-v&auml;limuistin Burst-tilan k&auml;ytt&ouml;&ouml;n yhdess&auml; v&auml;limuistin kanssa. WHDLoad ei ota data-v&auml;limuistin Burst-toimintoa k&auml;ytt&ouml;&ouml;n.<h4>Write Allocation</h4>Write Allocation ohjaa v&auml;limuistin k&auml;sittely&auml; 68030:ll&auml;, kun kirjoitustoiminnon aikana tapahtuu v&auml;limuistin ohitus. Write Allocation on otettava k&auml;ytt&ouml;&ouml;n, kun asennetusta ohjelmasta osa toimii User Modessa. Jos asennettu ohjelma toimii vain Supervisor Modessa voidaan Write Alloction kytke&auml; pois, jolloin saadaan hyvin pieni nopeusetu.<h4>Branch Cache</h4>
<p>Branch Cache on k&auml;ytett&auml;viss&auml; vain 68060:lla. Se on er&auml;&auml;nlainen k&auml;skyv&auml;limuisti haarak&auml;skyille. Erona k&auml;skyv&auml;limuistiin siihen ei kuitenkaan vaikuta MMU:n asetus! T&auml;m&auml; tarkoittaa, ett&auml; vaikka muistin sivu on merkitty tilaan Non Cacheable, kopioidaan haarak&auml;skyt v&auml;limuistiin jos Branch Cache on k&auml;yt&ouml;ss&auml;.</p>
<hr>Lis&auml;tietoja on Motorola-suorittimien k&auml;ytt&ouml;ohjeissa. Jos sinulla on korjattavaa tai lis&auml;tt&auml;v&auml;&auml; t&auml;h&auml;n sivuun, ota minuun <A
HREF="mailto:wepl@whdload.de">yhteytt&auml;</A>.</BODY>
</HTML>
