<HTML>
<HEAD>
<TITLE>WHDLoadCD32</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: cd32.html 1.5 2014/12/04 23:37:38 wepl Exp wepl $ --></HEAD>
<BODY>

<h3>WHDLoadCD32</h3>WHDLoadCD32 on erityinen WHDLoad-versio k&auml;ytett&auml;v&auml;ksi CD&sup3;&sup2;:ssa. Se on optimoitu t&auml;lle laitteistolle ja toimii siksi vain tavallisella, laajentamattomalla CD&sup3;&sup2;:lla. Se ei toimi SX-32:lla tai mill&auml;&auml;n muulla tietokoneella.<p>T&auml;ss&auml; ovat erot tavalliseen WHDLoadiin:<ul>

<li>se ei vaadi tai k&auml;yt&auml; WHDLoad-avaintiedostoa, joten WHDLoadCD32:n sis&auml;lt&auml;vi&auml; CD-levyj&auml; voidaan levitt&auml;&auml; vapaasti<li>tukee vain 68020-suoritinta, joten MMU-tukea ei ole<li>fast-muistia ei tueta<li>ei mink&auml;&auml;nlaista kirjoitustukea, ei tallennuksia, huipputuloksia tai muistidumppeja (CD on yleens&auml; vain luku -tyyppi&auml;)<li>monia valintoja, joita ei voi k&auml;ytt&auml;&auml; CD&sup3;&sup2;:lla, on poistettu, jotta tiedostosta saadaan pienempi ja muistia s&auml;&auml;styy. Katso kohdasta <a href="opt.html">K&auml;ytt&ouml; ja valinnat</a>, mihin valintoihin t&auml;m&auml; vaikuttaa<li>seuraavia resload-toimintoja ei ole toteutettu, ja niiden k&auml;ytt&ouml; lopettaa WHDLoadin paluukoodilla TDREASON_ILLEGALARGS:<ul>
<li><a href="../autodoc.html#resload_DiskLoadDev">resload_DiskLoadDev</a><li><a href="../autodoc.html#resload_ProtectRead">resload_ProtectRead</a><li><a href="../autodoc.html#resload_ProtectReadWrite">resload_ProtectReadWrite</a><li><a href="../autodoc.html#resload_ProtectWrite">resload_ProtectWrite</a><li><a href="../autodoc.html#resload_ProtectRemove">resload_ProtectRemove</a><li><a href="../autodoc.html#resload_ProtectSMC">resload_ProtectSMC</a><li><a href="../autodoc.html#resload_Log">resload_Log</a></ul>

<li>seuraavat resload-toiminnot ovat tyhji&auml;, ne eiv&auml;t tee mit&auml;&auml;n mutta palauttavat onnistuneen koodin:<ul>
<li><a href="../autodoc.html#resload_SaveFile">resload_SaveFile</a><li><a href="../autodoc.html#resload_SaveFileOffset">resload_SaveFileOffset</a><li><a href="../autodoc.html#resload_DeleteFile">resload_DeleteFile</a></ul>

<li><a href="freezer.html">j&auml;&auml;dytys/monitoritukea</a> ei ole sis&auml;llytetty<li>pinon koon riitt&auml;vyyden sis&auml;ist&auml; tarkistusta ei ole normaalin WHDLoadin tapaan, testieni mukaan 4096 tavun oletusarvon tulisi riitt&auml;&auml; WHDLoadCD32:lle</ul>

<h3>Vihjeit&auml; WHDLoadin k&auml;ytt&ouml;&ouml;n CD&sup3;&sup2;:ssa</h3>CD&sup3;&sup2;:n p&auml;&auml;ongelma on rajallinen muistim&auml;&auml;r&auml;. K&auml;ytett&auml;viss&auml; on vain 2 Mt chip-muistia. Tavoitteena tulee siis olla saada mahdollisimman paljon muistia vapaaksi WHDLoadille ja erityisesti <a href="opt.html#Preload">Preload/S</a>-toiminnolle. Varmista, ett&auml; muita ohjelmia ei ole k&auml;ynniss&auml;, kun k&auml;ynnist&auml;t asennetun ohjelman WHDLoadCD32:lla.<ul>

<li>Mik&auml;li asennustiedosto antaa valita levynkuvan ja tiedostojen v&auml;lill&auml;, k&auml;yt&auml; tiedostoja. Monet pienet tiedostot on helpompi lukea v&auml;limuistiin kuin harvat isot tiedostot.<li>Mik&auml;li asennustiedosto antaa mahdollisuuden pakata tiedostot ProPack/Flmp:ll&auml;, k&auml;yt&auml; sit&auml; ja pakkaa kaikki tiedostot (RNC1 antaa parhaan pakkaussuhteen). Pakatut tiedostot viev&auml;t v&auml;hemm&auml;n muistia PreLoad-toiminnolla, mutta ei aiheuta juuri hidastusta lataukseen.<li>Aja AllocMemReverse (tai sen korvike) ennen WHDLoadCD32:n k&auml;ytt&ouml;&auml;. AllocMemReverse on pieni ohjelma WHDLoadin kehitt&auml;j&auml;paketissa. Se muuttaa exec-toiminnon AllocMem niin, ett&auml; se k&auml;ytt&auml;&auml; aina muistiattribuuttia MEM_REVERSE varauksiin. T&auml;m&auml; aiheuttaa sen, ett&auml; muistia varataan vapaan muistin yl&auml;osasta alasp&auml;in eik&auml; tavalliseen tapaan alhaalta yl&ouml;s. T&auml;m&auml; pit&auml;&auml; muistin alaosan vapaana. Tausta on, ett&auml; WHDLoad tarvitsee muistia alkaen osoitteesta 0, chip-muistin alusta. Kaikki t&auml;ss&auml; alaosassa k&auml;yt&ouml;ss&auml; oleva muisti tulee vaihtaa. T&auml;m&auml;n vaihdetun muistin tallentamiseen tarvitaan lis&auml;&auml; muistia. Mit&auml; enemm&auml;n muistin alaosasta on k&auml;yt&ouml;ss&auml;, sit&auml; v&auml;hemm&auml;n on k&auml;ytett&auml;viss&auml; asennetulle ohjelmille ja datatiedostojen esilataukseen.<li>K&auml;yt&auml; aina <a href="opt.html#Data">Data</a>-valintaa. Preload ei tied&auml;, mitk&auml; tiedostot asennettu ohjelma lataa, joten se lataa kaikki l&ouml;yt&auml;m&auml;ns&auml; tiedostot. V&auml;lt&auml; turhien tiedostojen lataamista luomalla hakemisto, jossa on vain tarvittavat tiedostot. Poista kaikki tarpeeton, kuten #?.info, #?.Slave, ReadMe, Manual, .... K&auml;ynnist&auml; sitten WHDLoad Slave- ja Data-hakemistot argumentteina, esim. <tt>WHDLoadCD32 :Slaves/XYZ.Slave Data=:Data/XYZ Preload</tt>. Nykyist&auml; hakemistoa ei tarvitse muuttaa.<li>&Auml;l&auml; k&auml;yt&auml; XPK-pakattuja datatiedostoja. XPK-purku vaatii paljon muistia, koska XPK-kirjastot ladataan muistiin. Lis&auml;ksi itse purkaminen vaatii muistia ja se aiheuttaa muistin pirstoutumista.</ul>
</BODY>
</HTML>
