<HTML>
<HEAD>
<TITLE>Dumppaus</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: dump.html 1.3 2014/12/04 23:37:38 wepl Exp wepl $ --></HEAD>
<BODY>
<h3>WHDLoadin dumpit ja lokitiedostot</h3>L&auml;hinn&auml; vianetsint&auml;tarkoituksiin WHDLoad voi luoda useita dumppi- ja lokitiedostoja.<h4><a name="memory">Muistidumppi</a></h4>Muistidumppi on koko asennetun ohjelman k&auml;ytt&auml;m&auml; muisti kirjoitettuna tiedostoon. Dumpin koko riippuu asennetusta ohjelmasta (se vastaa Slave-rakenteen <a href="../autodoc.html#ws_BaseMemSize">ws_BaseMemSize</a>-arvoa). Muistidumppi luodaan, jos <a href="opt.html#DebugKey">DebugKey</a>-n&auml;pp&auml;int&auml; painetaan tai CoreDump-painiketta painetaan virheen j&auml;lkeen. Luodun muistidumpin tiedostonimi on &quot;.whdl_memory&quot;. tallennuspaikan oletus on &quot;PROGDIR:&quot;, mutta sit&auml; voidaan muuttaa <a href="opt.html#CoreDumpPath">CoreDumpPath</a>-valinnalla. Olemassa oleva, saman niminen tiedosto ylikirjoitetaan aina. Jos asennettu ohjelma k&auml;ytt&auml;&auml; lis&auml;ksi Expansion-muistia (<a href="../autodoc.html#ws_ExpMem">ws_ExpMem</a>), se tallennetaan nimelle &quot;.whdl_expmem&quot;.<h4><a name="register">Rekisteridumppi</a></h4>Rekisteridumppi sis&auml;lt&auml;&auml; CPU:n (sek&auml; MMU:n), CIA:n ja erikoispiirien t&auml;ydellisen tilan. Joitain CIA- ja Custom-rekistereit&auml; ei voi lukea, ja ne ovat mukana dumpissa vain jos <a
href="opt.html#Snoop">Snoop</a>-tila on aktiivinen. Tiedot kirjoitetaan ASCII-tiedostoon korostettuna Escape-jaksoilla (k&auml;ytt&auml;en CSI - Control Sequence Introducer -merkki&auml;, desimaali 155). Tarkasteluun suositellaan Escape-jaksoja tukevaa ohjelmaa (esim. More, MuchMore, MultiView jne.). Dumppitiedoston nimi on &quot;.whdl_register&quot; ja tallennuspaikan oletus on &quot;PROGDIR:&quot;, muta sit&auml; voidaan muuttaa <a
href="opt.html#CoreDumppath">CoreDumpPath</a>-valinnalla. Jos saman niminen tiedosto on jo olemassa, dumppi lis&auml;t&auml;&auml;n sen loppuun - muuten luodaan uusi tiedosto.<h4><a name="complete">T&auml;ydellinen dumppitiedosto</a></h4> T&auml;ydellinen dumppitiedosto on IFF-tiedosto, joka sis&auml;lt&auml;&auml; kaikkien aiempien dumppitiedostojen sis&auml;ll&ouml;n. Se on suunniteltu muiden sovellusten k&auml;ytt&ouml;&ouml;n. Tiedoston rakenne on kuvattu ylim&auml;&auml;r&auml;isess&auml; include-tiedostossa nimelt&auml; <tt>whddump.i</tt>. T&auml;ll&auml; hetkell&auml; t&auml;ydellist&auml; dumppitiedostoa lukevat sovellukset WHDLoadGCI (graafinen ohjelmoijan k&auml;ytt&ouml;liittym&auml;) ja <a
href="sp.html">SP</a> (tallenna kuva). Luodun t&auml;ydellisen dumppitiedoston nimi on &quot;.whdl_dump&quot;. tallennuspaikan oletus on &quot;PROGDIR:&quot;, mutta sit&auml; voidaan muuttaa <a
href="opt.html#CoreDumpPath">CoreDumpPath</a>-valinnalla. Nykyinen tiedosto ylikirjoitetaan aina.<h4><a name="FileLog">Tiedostohakuloki</a></h4>Jos <a
href="opt.html#FileLog">FileLog/S</a>-valinta on k&auml;yt&ouml;ss&auml;, kaikki levyhaut kirjataan lokiin. T&auml;m&auml; toiminto on hy&ouml;dyllinen, jos halutaan analysoida asennetun ohjelman levynk&auml;ytt&ouml;&auml; vianetsint&auml;- ja optimointitarkoituksiin. Seuraava resload-toiminto luo kirjauksen lokitiedostoon:<ul>
<li><a href="../autodoc.html#resload_DeleteFile">resload_DeleteFile</a><li><a href="../autodoc.html#resload_DiskLoad">resload_DiskLoad</a><li><a href="../autodoc.html#resload_Examine">resload_Examine</a><li><a href="../autodoc.html#resload_ExNext">resload_ExNext</a><li><a href="../autodoc.html#resload_GetFileSize">resload_GetFileSize</a><li><a href="../autodoc.html#resload_GetFileSizeDec">resload_GetFileSizeDec</a><li><a href="../autodoc.html#resload_ListFiles">resload_ListFiles</a><li><a href="../autodoc.html#resload_LoadFile">resload_LoadFile</a><li><a href="../autodoc.html#resload_LoadFileDecrunch">resload_LoadFileDecrunch</a><li><a href="../autodoc.html#resload_LoadFileOffset">resload_LoadFileOffset</a><li><a href="../autodoc.html#resload_SaveFile">resload_SaveFile</a><li><a href="../autodoc.html#resload_SaveFileOffset">resload_SaveFileOffset</a></ul>Kukin tiedoston k&auml;ytt&ouml; yll&auml; olevien toimintojen kautta luo yhden rivin lokitiedostoon. Rivill&auml; on kutsuttu funktio, luetun/kirjoitetun datan CRC-tarkistussumma, parametrit sek&auml; tulos. WHDLoad ker&auml;&auml; lokikirjaukset sis&auml;iseen <a href="opt.html#LogBuffer">LogBuffer/K/N</a>-puskuriin. Puskuri tyhjennet&auml;&auml;n poistuttaessa tai kirjauksen aikana, jos puskuri on t&auml;ynn&auml;. Tiedot kirjoitetaan ASCII-tiedostoon. Dumppitiedoston nimi on &quot;.whdl_log&quot; (WHDLoad v18.0:aa aiemmissa versioissa se oli &quot;.whdl_filelog&quot;). tallennuspaikan oletus on &quot;PROGDIR:&quot;, mutta sit&auml; voidaan muuttaa <a href="opt.html#CoreDumppath">CoreDumpPath</a>-valinnalla. Jos saman niminen tiedosto on jo olemassa, dumppi lis&auml;t&auml;&auml;n sen loppuun - muuten luodaan uusi tiedosto.<h4><a name="CustLog">Muokatut lokikirjaukset</a></h4> WHDLoad-versiosta 18.0 alkaen on mahdollista luoda ylim&auml;&auml;r&auml;isi&auml; muokattuja lokikirjauksia tiedostoon &quot;.whdl_log&quot; k&auml;ytt&auml;m&auml;ll&auml; toimintoa <a href="../autodoc.html#resload_Log">resload_Log</a>. Kirjaukset voidaan muotoilla k&auml;ytt&auml;en sprintf-tyyppisesti muotoiltua merkkijonoa ja parametreja. Merkinn&auml;t tallennetaan v&auml;liaikaisesti <a href="opt.html#LogBuffer">LogBuffer/K/N</a>-puskuriin, jotta v&auml;ltet&auml;&auml;n vaihto takaisin k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;n. Jos kirjauksia on suuri m&auml;&auml;r&auml;, LogBufferin kokoa pit&auml;&auml; kasvattaa vastaavasti. Jotta lokikirjaukset kirjoitetaan, valinta <a href="opt.html#FileLog">FileLog/S</a> pit&auml;&auml; aktivoida.</BODY>
</HTML>
