<HTML>
<HEAD>
<TITLE>Usein kysytyt kysymykset (UKK)</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: faq.html 1.4 2015/12/23 22:35:27 wepl Exp wepl $ --></HEAD>
<BODY>
<h3>Usein kysytyt kysymykset (UKK)</h3>
<table>
<tr><td valign=top><i>Kysymys:</i></td><td><b>Ok, sain asennusohjelman ja joko asennuksessa tai k&auml;ynnistyksess&auml; on ongelmia. Olen varma, ett&auml; olen tehnyt kaiken oikein t&auml;h&auml;n menness&auml;. Mit&auml; teen nyt?</b></td></tr><tr><td valign=top><i>Vastaus:</i></td><td>V&auml;&auml;r&auml; toiminta voi johtua monestakin syyst&auml;:<ul>
<li>v&auml;&auml;r&auml;t/puuttuvat Tooltypet<br> Jotkin tiedostot eiv&auml;t toimi oikein (tai ollenkaan), ellet aseta oikeita tooltypej&auml; j&auml;rjestelm&auml;&auml;si. Lue ohjeesta, mitk&auml; tooltypet ovat tuettuja. Apua voi olla mm. tooltypeist&auml; NoCache, NoVBRMove, NoAutoVec, PAL/NTSC, NoMMU.<li>asennuspaketin mukana tuleva readme-tiedosto<br>T&auml;m&auml; selitt&auml;&auml; usein tietyt ongelmat sek&auml; avaimet tai tooltypet, jotka tulee asettaa.<li>v&auml;&auml;r&auml; WHDLoad-versio<br> Suurin osa asennusohjelmista tarvitsee uusimman WHDLoadin eik&auml; toimi vanhemmalla. Kultainen s&auml;&auml;nt&ouml; on asentaa aina uusin versio.<li>kone on ep&auml;yhteensopiva<br> Erityisesti 68040/060-CPU tai turbokortit/muut laitteet voivat aiheuttaa ongelmia. Yrit&auml; kytke&auml; kaikki ylim&auml;&auml;r&auml;inen laitteisto pois ja yrit&auml; k&auml;ynnist&auml;&auml; asennusohjelma uudelleen.<li>ei-tuettu versio<br> Monia kaupallisia pelej&auml; on myyty useina versioina (t&auml;ysihintainen/uudelleenjulkaisu budjettiversiona/coverdiskin&auml;, PAL/NTSC-versio jne.). Asennusohjelma voi tietenkin toimia vain, jos se on laadittu erityisesti pelin tietty&auml; versiota varten. Jos sinulla on eri versio samasta pelist&auml;, se ei toimi. T&auml;ss&auml; tapauksessa ainoa tapa k&auml;ytt&auml;&auml; asennusohjelmaa on ottaa yhteytt&auml; asennusohjelman tekij&auml;&auml;n ja pyyt&auml;&auml; tukea omalle versiollesi. Useimmiten tekij&auml; auttaa ja korjaa asennusohjelman toimimaan my&ouml;s sinun versiollasi muutaman p&auml;iv&auml;n kuluessa.<li>vanha asennusohjelman versio<br> Kun bugi havaitaan ja poistetaan, ohjelmasta tulee uusi versio WHDLoadin verkkosivuille. Hae aina uusin asennusohjelman versio. Huomaa, ett&auml; Aminetiss&auml; ei ole aina uusinta versiota. Joitakin korjauksia ei julkaista Aminetissa ollenkaan, ja monet julkaistaan viikkojen viiveell&auml;!<li>l&ouml;ysit bugin<br> Vaikka kaikki ohjelmat kokeillaan ennen julkaisua, on bugi voinut p&auml;&auml;st&auml; mukaan huomaamatta. Jos luulet l&ouml;yt&auml;neesi bugin, kirjoita ongelmastasi tarkka raportti asennusohjelman tekij&auml;lle. K&auml;yt&auml; t&auml;h&auml;n bugi-ilmoituslomaketta. Yrit&auml; kuvailla ongelma mahdollisimman tarkasti. Jos emme saa tietoa bugeista, emme voi korjata niit&auml;. Huomaa: AINOA oikea paikka ilmoittaa ongelmista/bugeista on bugi-ilmoituslomake, ei comp.sys.amiga.games tai jokin foorumi, koska kaikki kehitt&auml;j&auml;t eiv&auml;t lue sit&auml;.</ul>
</td></tr>
<tr><td valign=top><i>Kysymys:</i></td><td><b>Minulla on peli, mutta en l&ouml;yd&auml; sille asennusohjelmaa.</b></td></tr><tr><td valign=top><i>Vastaus:</i></td><td>Tee luettelo toiveistasi. Voit liitt&auml;&auml; mukaan pelej&auml;, jotka voi jo asentaa kiintolevylle (kopioitavia tiedostoja ja/tai asennusohjelma pelin mukana) tai joissa on ongelmia (jopa pienet yhteensopivuusongelmat tai puuttuva poistuminen). Muista, ett&auml; yksi henkil&ouml; voi korjata vain noin 25 peli&auml; vuodessa. Ilmaise, mitk&auml; ovat suosikkejasi (esim. ! ja +) ja mist&auml; et pid&auml; (-), ja tarkista, miss&auml; peleiss&auml; on jo kiintolevyasennus.</td></tr>
<tr><td valign=top><i>Kysymys:</i></td><td><b>Voiko WHDLoadia k&auml;ytt&auml;&auml; asentamaan demoa/peli&auml;, joka k&auml;ytt&auml;&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;&auml;?</b></td></tr><tr><td valign=top><i>Vastaus:</i></td><td>Yleisesti ottaen WHDLoadia k&auml;ytt&auml;v&auml; demo/peli ei voi k&auml;ytt&auml;&auml; k&auml;ytt&ouml;j&auml;rjestelm&auml;n ominaisuuksia WHDLoadin ulkopuolelta. Slave-ohjelman kirjoittajana sinun on ohjattava uudelleen kaikki k&auml;ytt&ouml;j&auml;rjestelm&auml;kutsut. Ne on joko kytkett&auml;v&auml; pois tai emuloitava oikealla tavalla. Emulointia varten on ns. KickEmu-paketteja. Niit&auml; on saatavilla eri Kickstart-versioille (esim. &apos;Sources/whdload/kick13.s&apos;). K&auml;ytt&auml;m&auml;ll&auml; oikeaa kickstart-kuvaa ne luovat t&auml;ydellisen k&auml;ytt&ouml;j&auml;rjestelm&auml;ymp&auml;rist&ouml;n WHDLoadin muistin sis&auml;&auml;n. Aihetta koskee erillinen ReadMe-tiedosto: &apos;Sources/whdload/kick.readme&apos;.</td></tr>
<tr><td valign=top><i>Kysymys:</i></td><td><b>Jos WHDLoad k&auml;ytt&auml;&auml; MMU:ta (valinta <a href="opt.html#NoMMU">NoMMU/S</a> ei ole k&auml;yt&ouml;ss&auml; ja 68030:lla valinta <a href="opt.html#MMU">MMU/S</a> on k&auml;yt&ouml;ss&auml;), grafiikassa ja/tai musiikissa on h&auml;iri&ouml;it&auml; (esim. Beast2). Onko t&auml;m&auml; bugi ?</b></td></tr><tr><td valign=top><i>Vastaus:</i></td><td>T&auml;m&auml; tapahtuu latauksen aikana. Syy on se, ett&auml; WHDLoadin on pys&auml;ytett&auml;v&auml; keskeytykset latauksen aikana lyhyeksi ajaksi, jos MMU on k&auml;yt&ouml;ss&auml;. T&auml;t&auml; k&auml;ytt&auml;ytymist&auml; ei voi muuttaa.</td></tr>
<tr><td valign=top><i>Kysymys:</i></td><td><b>Kun yrit&auml;n k&auml;ytt&auml;&auml; NTSC-tooltype&auml;, WHDLoad antaa gurun.</b></td></tr><tr><td valign=top><i>Vastaus:</i></td><td>MCP 1.30:n ScreenManagerissa on bugi, jonka johdosta WHDLoadin OpenScreenTags-kutsu kaatuu. Korjaa ongelma kytkem&auml;ll&auml; MCP:n ScreenManager pois.</td></tr>
<tr><td valign=top><i>Kysymys:</i></td><td><b>Kun ajan pelej&auml;, ne toimivat normaalia nopeammin (musiikki kuulostaa oudolta) ja n&auml;yt&ouml;n alaosa puuttuu. Olen kokeillut PAL- ja NTSC-tooltypej&auml;, mutta niist&auml; ei ole apua.</b></td></tr><tr><td valign=top><i>Vastaus:</i></td><td>Jos k&auml;yt&auml;t Voodoo-n&auml;ytt&ouml;ohjaintiedostoa, kytke sen tooltypeist&auml; pois &quot;FakeNativeModes&quot;.</td></tr>
</table>
</BODY>
</HTML>
