<HTML>
<HEAD>
<TITLE>J&auml;rjestelm&auml;monitorit / Muistin j&auml;&auml;dytys</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: freezer.html 1.5 2014/12/04 23:37:38 wepl Exp wepl $ --></HEAD>
<BODY>
<h3>J&auml;rjestelm&auml;monitorit / Muistin j&auml;&auml;dytys</h3>Ohjelmistopohjaisia muistin j&auml;&auml;dytt&auml;ji&auml; on useita. T&auml;llaisten ty&ouml;kalujen k&auml;ytt&ouml; voi olla suureksi avuksi Slave-tiedostojen kehityksess&auml; sek&auml; niiden ja asennetun ohjelman vianetsinn&auml;ss&auml;. WHDLoad tukee suoraan HRTmon- ja ThrillKill-ohjelmia. Jos haluat suoran tuen jollekin muulle ohjelmalle, voit ottaa minuun yhteytt&auml;. Lis&auml;&auml;n tuen, jos se on mahdollista. K&auml;ynnistyksen yhteydess&auml; WHDLoad tarkistaa, onko jokin tuetuista monitoreista k&auml;ynniss&auml;. Jos sellainen l&ouml;ytyy, WHDLoad muuttaa joitakin asioita. Jos WHDLoad k&auml;ytt&auml;&auml; MMU:ta, se muuttaa monitorin k&auml;ytt&auml;m&auml;n muistin kelvolliseksi ja kopioitavaksi WriteThrough-v&auml;limuistiin. Pelin/demon k&auml;ydess&auml; se ohjaa kaikki NMI-poikkeukset NMI-vektorille monitorin vektoritaulukosta. Lis&auml;ksi jos WHDLoad siirt&auml;&auml; VBR:n (<a href="opt.html#NoVBRMove">NoVBRMove/S</a> ei ole asetettuna ja suoritin on v&auml;hint&auml;&auml;n 68010), se vertaa <a
href="opt.html#FreezeKey">FreezeKey</a>-arvoa n&auml;pp&auml;imist&ouml;n arvoon kunkin keskeytyksen kohdalla. Jos arvo on sama, WHDLoad huomioi n&auml;pp&auml;imist&ouml;n, muuttaa pinokehyksen NMI-pinokehykseksi ja siirtyy monitoriin sen NMI-k&auml;sittelij&auml;n kautta.<h4>HRTmon</h4>Tunnistuksen muistista pit&auml;isi olla turvallista erityisesti monitorin uudempien versioiden kanssa, koska monitoriin on lis&auml;tty uusi allekirjoitus. Ole varovainen, jos WHDLoad k&auml;ytt&auml;&auml; MMU:ta. &Auml;l&auml; k&auml;yt&auml; BaseMem/ExpMem-alueen ulkopuolista muistia HRTmonin kautta. Se kaataa koneen, koska HRTmon ei osaa k&auml;sitell&auml; tuloksena olevaa Access Fault Exception -poikkeusta.<p>HRTmonPrefsist&auml; on valittava &apos;No VBR move&apos; -laatikko, sill&auml; muuten et voi siirty&auml; monitoriin WHDLoadin ollessa k&auml;ynniss&auml;.<p>Kun palaat HRTmonista WHDLoadin alla toimivaan ohjelmaan, saatat huomata grafiikoiden n&auml;kyv&auml;n v&auml;&auml;rin. T&auml;m&auml; johtuu siit&auml;, ett&auml; HRTmon ylikirjoittaa jonkin Custom-rekisterin. Voit kiert&auml;&auml; t&auml;m&auml;n kertomalla HRTmonille oikean arvon, esim. kirjoittamalla <tt>&apos;e $100 $5200&apos;</tt> saat 32-v&auml;risen ruudun ennen paluuta.<p>WinUAE:n sis&auml;&auml;nrakennettu HRTmon voidaan havaita vain, jos HRTmon on aktivoitu ainakin kerran aiemmin  (paina PgUp). T&auml;m&auml; johtuu siit&auml;, ett&auml; vasta ensimm&auml;isell&auml; aktivoinnilla asetetaan NMI-vektori, jolla WHDLoad l&ouml;yt&auml;&auml; monitorin.<p>Uudet HRTmon-versiot lis&auml;&auml;v&auml;t k&auml;ytt&ouml;&ouml;n erikoiskomentoja, kun ne suoritetaan WHDLoadin alla. Vot ladata/tallentaa tiedostoja ja k&auml;ytt&auml;&auml; <a
href="prot.html">resload_Protect#?</a>-funktioita HRTmonin sis&auml;lt&auml;. N&auml;m&auml; versiot ovat ladattavissa <a
href="http://www.whdload.de/whdload/Tools/">WHDLoad-sivulta</a>.<h4>ThrillKill</h4>J&auml;&auml;dytysohjelmalla ei ole k&auml;ytt&ouml;kelpoista allekirjoitusta, joten k&auml;yt&ouml;ss&auml; on koodivertailu. T&auml;m&auml;n vuoksi tunnistus toimii vain tunnettujen julkaisujen kanssa.</BODY>
</HTML>
