<HTML>
<HEAD>
<TITLE>WHDLoad ja MMU</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: mmu.html 1.3 2014/12/04 23:37:38 wepl Exp wepl $ --></HEAD>
<BODY>
<h3>WHDLoad ja muistinhallintayksikk&ouml; (MMU)</h3>Seuraavissa 68000-perheen suorittimissa on MMU: 68030, 68040, 68060. Suorittimista on my&ouml;s ns. EC-versioita, joissa on rikkin&auml;inen, pois kytketty MMU. Esimerkiksi kaikissa vakiomallin A4000/030-koneissa on vain 68EC030-suoritin. Ulkopuolisten rakentamissa kiihdytinkorteissa t&auml;m&auml; vaihtelee, katso tarkemmat tiedot ohjeista. Tiet&auml;&auml;kseni kaikki Amigoissa k&auml;ytetyt 68040/68060-suorittimet ovat t&auml;ydellisi&auml; ja sis&auml;lt&auml;v&auml;t toimivan MMU:n. T&auml;m&auml; johtuu siit&auml;, ett&auml; Zorro III vaatii IO-alueen MMU-ohjauksen. Kokonaista suoritinta ja EC-versiota ei voida erottaa ohjelmallisesti. Siksi k&auml;ytt&auml;j&auml;n on teht&auml;v&auml; se asettamalla WHDLoadille <a href="#usercontrol">oikeat valinnat</a>. <br>68020:lle on saatavilla ulkoinen MMU 68851, mutta WHDLoad ei t&auml;ll&auml; hetkell&auml; tue sit&auml;.<h4>MMU:n ominaisuudet ja k&auml;ytt&ouml; WHDLoadissa</h4>MMU:n t&auml;rkein tarkoitus on muuntaa loogiset osoitteet fyysisiksi. T&auml;m&auml; vaaditaan virtuaalimuistille sek&auml; erillisille osoiteavaruuksille. Toinen ominaisuus on kyky m&auml;&auml;ritt&auml;&auml; erikoisominaisuuksia kuten Supervisor Only-, Write Protected- ja Caching-tila jokaiselle fyysiselle osoiteavaruudelle sivupohjaisesti, jolloin WHDLoadin k&auml;ytt&auml;m&auml; sivu on 4096 tavua. WHDLoad ei k&auml;yt&auml; loogisten osoitteiden muuntoa fyysiseksi. Se k&auml;ytt&auml;&auml; MMU:ta <a href="#mem">muistin suojaukseen</a>, <a
href="cache.html">v&auml;limuistn hallintaan</a> sek&auml; erikoistoimintohin, kuten <a
href="snoop.html">Snooping</a> ja <A
HREF="../autodoc.html">resload_Protect#?</a>.<h4><a name="mem">Muistin suojaus WHDLoadissa</a></h4>K&auml;ynnistett&auml;ess&auml; WHDLoad tarkistaa nykyisen muistilistan ja rakentaa k&auml;&auml;nn&ouml;spuun, johon kuuluu kaikki k&auml;ytett&auml;viss&auml; oleva muisti. Se merkitsee seuraavat osoiteavaruudet kelvollisiksi ja k&auml;ytett&auml;viksi: $0...BaseMem (perustuen Slaven tietoihin), $dff000...$dff200 (Custom-rekisterit), $bfd000...$bff000 (CIA-rekisterit) sek&auml; Slaven ja WHDLoadin k&auml;ytt&auml;m&auml; muisti. Jos muistista l&ouml;ytyy j&auml;&auml;dytysohjelma, my&ouml;s sen k&auml;ytt&auml;m&auml; muisti merkit&auml;&auml;n kelvolliseksi. Kaikki muu muisti merkit&auml;&auml;n ep&auml;kelvoksi, ja t&auml;llaisen alueen k&auml;ytt&ouml; (luku tai kirjoitus) luo Access Fault Exception -poikkeuksen ja tuottaa WHDLoadin kautta sopivan virheilmoituksen.<h4><a name="usercontrol">K&auml;ytt&auml;j&auml;n ohjaus WHDLoadin MMU-k&auml;sittelyyn</a></h4>WHDLoad voi vaikuttaa MMU:hun kolmella eri tavalla.<ol>
<li><b>ohita MMU</b>:<br> T&auml;ss&auml; tilassa WHDLoad ei muuta MMU:n rekistereit&auml;. T&auml;m&auml; voi olla hy&ouml;dyllist&auml;, jos k&auml;ynniss&auml; olevat ohjelmat kuormittavat MMU:ta ja haluat niiden toiminnan pysyv&auml;n ennallaan (esim. TK:n kaltainen ohjelmistopohjainen j&auml;&auml;dytysohjelma). <br>Varoitus: Koska WHDLoad ei ohjaa MMU:ta itse, voi ilmet&auml; paljon ongelmia. Ongelmat voivat aiheuttaa kaatumista, v&auml;&auml;r&auml;&auml; toimintaa tai muuta ennustamatonta k&auml;yt&ouml;st&auml;. T&auml;ss&auml; on lueteltuna joitakin riskej&auml;:<ul>
<li>Enforcerin/CyberGuardin tai vastaavan ty&ouml;kalun k&auml;ytt&auml;minen jumittaa/kaataa koneen, koska WHDLoad luo useita Hittej&auml; joka kerta, kun k&auml;ytt&ouml;j&auml;rjestelm&auml; kytket&auml;&auml;&auml;n pois ja p&auml;&auml;lle. N&auml;m&auml; eiv&auml;t ole WHDLoadin bugeja vaan normaalia toimintaa.<li>uudemmat 68060.libraryn versiot (alkaen v41.1:st&auml;) siirt&auml;v&auml;t muistiosoitteet $0-$1000 (ensimm&auml;isen sivun) Fast-muistiin MMU:n avulla. MMU:n ohitustilassa t&auml;m&auml; osoitemuunnos j&auml;&auml; voimaan, ja jos asennettu ohjelma yritt&auml;&auml; k&auml;ytt&auml;&auml; t&auml;t&auml; aluetta DMA-toimintoihin (esim. copperlistiin), lopputuloksia ei voi ennustaa, sill&auml; suoritin lukee ja kirjoittaa Fast-muistia kun taas DMA toimii Chip-muistissa, jossa voi olla mit&auml; tahansa tietoa.<li>jos k&auml;ynniss&auml; oleva MMU-ohjelma k&auml;ytt&auml;&auml; muistia (poikkeusk&auml;sittelij&auml;, k&auml;&auml;nn&ouml;spuu jne.) asennetun ohjelman BaseMemin sis&auml;ll&auml;, se voi kaatua, sill&auml; BaseMem ylikirjoitetaan (tilap&auml;isesti) asennetun ohjelman suorituksen aikana<li>yleisesti ottaen jokainen ohjelma, joka muuttaa j&auml;rjestelm&auml;n perustoimintoja (MMU:lla) voi olla ristiriidassa WHDLoadin kanssa...</ul>
<li><b>kytke MMU pois</b>:<br> T&auml;ss&auml; tilassa, jota voidaan k&auml;ytt&auml;&auml; vain 68030:ll&auml;, WHDLoad kytkee MMU:n pois p&auml;&auml;lt&auml; eik&auml; MMU-toimintoja ole k&auml;ytett&auml;viss&auml;.<li><b>k&auml;yt&auml; MMU:ta</b>:<br> T&auml;ss&auml; tilassa WHDLoad ottaa MMU:n t&auml;ysin k&auml;ytt&ouml;&ouml;ns&auml; ja toteuttaa muistinsuojauksen ja v&auml;limuistin hallinnan yll&auml; kuvatulla tavalla.</ol>68030:ll&auml; oletustila on <i>kytke MMU pois</i>. 68040/68060:ll&auml; oletus on <i>k&auml;yt&auml; MMU:ta</i>. K&auml;yt&ouml;st&auml; voidaan ohjata kahdella valinnalla. <a href="opt.html#MMU">MMU/S</a> pakottaa WHDLoadin <i>k&auml;ytt&auml;m&auml;&auml;n</i> <i>MMU:ta</i> ja se vaaditaan 68030:ll&auml;, jotta MMU-ominaisuudet saadaan k&auml;ytt&ouml;&ouml;n. <a href="opt.html#NoMMU">NoMMU/S</a> kytkee WHDLoadin MMU:n k&auml;yt&ouml;n pois(<i>ohita MMU</i>).<center><p><cite>Enforcer hit on Enforcer hit, se siit&auml;.</cite> (Michael Sinz)</p></center>
</BODY>
</HTML>
