<HTML>
<HEAD>
<TITLE>Verkkotoiminnot</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: net.html 1.1 2015/04/19 21:04:15 wepl Exp wepl $ --></HEAD>
<BODY>

<h3>Verkkotoimintojen yleiskatsaus</h3>WHDLoad voi tarkistaa verkon kautta, onko WHDLoadista ja k&auml;yt&ouml;ss&auml; olevasta Slave-tiedostosta saatavana uudempaa versiota. Kaikki verkkoliikenne k&auml;ytt&auml;&auml; HTTP-protokollaa. Yleisell&auml; valinnalla <a href="opt.html#Proxy">Proxy/S</a> kaikki verkkoliikenne voidaan ohjata v&auml;lityspalvelimen kautta. Jos v&auml;lityspalvelin vaatii todennusta, k&auml;ytt&auml;j&auml;nimi ja salasana voidaan m&auml;&auml;ritt&auml;&auml; <a
href="opt.html#Proxy">Proxy/S</a>-valinnalla. WHDLoad tukee vain perustason todennusta. <br>Jos WHDLoadin ei haluta k&auml;ytt&auml;v&auml;n verkkoa, kaikki verkon toiminta voidaan kytke&auml; pois yleisell&auml; valinnalla <a href="opt.html#NoNetwork">NoNetwork/S</a>.<h3>WHDLoadin ja Slave-tiedoston p&auml;ivitystarkistus</h3>WHDLoadin verkkosivustoon tehdyn pyynn&ouml;n avulla tarkistetaan, onko WHDLoadista tai asennetusta ohjelmasta (Slave-tiedostosta) julkaistu uudempaa versiota. <br>Tarkistus tehd&auml;&auml;n vain, jos <a href="opt.html#SplashDelay">k&auml;ynnistysikkuna</a> avataan, sill&auml; tulostiedot n&auml;kyv&auml;t siin&auml;.<p>WHDLoadin p&auml;ivitystarkistusta varten l&auml;hetet&auml;&auml;n k&auml;yt&ouml;ss&auml; oleva WHDLoadin versionumero. Jos uudempi WHDLoad-versio on saatavilla, k&auml;ynnistysikkunassa n&auml;kyy uusimman WHDLoad-julkaisun versionumero ja julkaisup&auml;iv&auml;. Lis&auml;ksi k&auml;ynnistysikkunassa n&auml;kyy painike &apos;Update WHDLoad&apos; (P&auml;ivit&auml; WHDLoad). Jos olet asentanut <a
href="http://sourceforge.net/projects/openurllib/">openurl.libraryn</a>, painike avaa WHDLoadin kotisivun k&auml;ytt&ouml;&ouml;n m&auml;&auml;ritt&auml;m&auml;ss&auml;si verkkoselaimessa. Jos openurl.library ei ole k&auml;ytett&auml;viss&auml;, n&auml;kyviin tulee kehote, jossa lukee WHDLoadin kotisivun URL-osoite. Jos valinta <a href="opt.html#Expert">Expert/S</a> on asetettu, p&auml;ivitystarkistus ilmoittaa my&ouml;s WHDLoadin uusista beetaversioista.<p>Slave-tiedoston p&auml;ivitystarkistusta varten WHDLoad laskee Slave-tiedoston SHA-256-tunnisteen, joka l&auml;hetet&auml;&auml;n WHDLoadin verkkosivustoon. Kaikista julkaistuista Slave-tiedostoista on olemassa tietokanta. Jos uudempi asennusohjelman tai Slave-tiedoston versio on saatavilla, k&auml;ynnistysikkunassa n&auml;kyy uusimman asennusohjelman julkaisup&auml;iv&auml;. Lis&auml;ksi k&auml;ynnistysikkunassa n&auml;kyy painike &apos;Update Slave&apos; (P&auml;ivit&auml; Slave-tiedosto). Jos olet asentanut <a href="http://sourceforge.net/projects/openurllib/">openurl.libraryn</a>, painike avaa ko. asennusohjelman WHDLoad-sivun k&auml;ytt&ouml;&ouml;n m&auml;&auml;ritt&auml;m&auml;ss&auml;si verkkoselaimessa. Jos openurl.library ei ole k&auml;ytett&auml;viss&auml;, n&auml;kyviin tulee kehote, jossa lukee WHDLoad-asennuksen sivun URL-osoite.<p>Jos uudempi WHDLoadin tai Slave-tiedoston versio on saatavana, k&auml;ynnistysikkunaan lis&auml;t&auml;&auml;n ylim&auml;&auml;r&auml;inen &apos;Start&apos; (K&auml;ynnist&auml;) -painike, eik&auml; ikkuna sulkeudu automaattisesti. N&auml;in voidaan korostaa p&auml;ivityksen mahdollisuutta. Ikkuna voidaan sulkea normaalisti k&auml;ytt&auml;m&auml;ll&auml; hiirt&auml; tai painamalla v&auml;lily&ouml;nti&auml; tai Return- tai Esc-n&auml;pp&auml;int&auml;.<p>Jos <a href="http://sourceforge.net/projects/openurllib/">openurl.library</a> on k&auml;yt&ouml;ss&auml; ja &apos;Update&apos; (P&auml;ivit&auml;) -painiketta painetaan, WHDLoad suorittaa <a
href="opt.html#ExecuteCleanup">ExecuteCleanup/K</a>-komennon, jolla voidaan ottaa k&auml;ytt&ouml;&ouml;n <a href="opt.html#ExecuteStartup">ExecuteStartup/K</a>-komennon k&auml;yt&ouml;st&auml; poistama IP-pino. T&auml;m&auml; voi ep&auml;onnistua, mik&auml;li muisti ei riit&auml; verkkoselaimen k&auml;ynnist&auml;miseen, koska <a href="opt.html#Preload">Preload/S</a> on varannut suurimman osan muistista. Jos muisti on v&auml;hiss&auml;, &apos;Update&apos; (P&auml;ivit&auml;) -painike ei ehk&auml; n&auml;y.</BODY>
</HTML>
