<HTML>
<HEAD>
<TITLE>resload_Protect#?:n k&auml;ytt&ouml;</TITLE>
<meta name="DC.Language" content="fi">
<meta http-equiv="content-language" content="fi">
<meta http-equiv="content-type" content="text/html; charset=Windows-1252"><!-- $Id: prot.html 1.3 2014/12/04 23:37:38 wepl Exp wepl $ --></HEAD>
<BODY>
<h3>resload_Protect#?:n k&auml;ytt&ouml;</h3>
<h4>Teoria</h4>Monissa eri tilanteissa voi olla hy&ouml;dyllist&auml; tiet&auml;&auml;, koska asennettu ohjelma k&auml;ytt&auml;&auml; tiettyj&auml; muistiosoitteita. Toiminnon <a href="../autodoc.html">resload_Protect#?</a> avulla on mahdollista suojata tiettyj&auml; muistialueita suorittimen lukemiselta ja/tai kirjoitukselta. Suojaus tarkoittaa, ett&auml; jokainen haku suojatulle alueelle tuottaa Access Fault -poikkeuksen, josta WHDLoad antaa asiaankuuluvan valintaikkunan. Jos m&auml;&auml;rit&auml;t muistialueen suojatuksi <a href="../autodoc.html">resload_Protect#?</a>-funktiolla, WHDLoad muokkaa sit&auml; koskevia sivun kuvaajia MMU:n k&auml;&auml;nt&ouml;puussa. Nyt joka kerta yritt&auml;ess&auml;&auml;n k&auml;ytt&auml;&auml; suojattua sivua suoritin luo Access Fault -poikkeuksen. WHDLoadin sis&auml;inen poikkeusk&auml;sittelij&auml; varmentaa poikkeuksen syyn. Jos syy oli suojatun <a href="mmu.html">sivun</a> k&auml;ytt&ouml;, mutta k&auml;ytt&ouml; ei vastaa suojattua aluetta k&auml;ytt&ouml; emuloidaan ja normaali ohjelman suoritus jatkuu. Muuten WHDLoad lopettaa toiminnan ja antaa asiaankuuluvan ilmoituksen. Jos k&auml;ytt&ouml; oli k&auml;skyvirran k&auml;ytt&ouml; (ts. suoritin yritti ladata koodia), se emuloidaan aina, toisin sanoen <a
href="../autodoc.html">resload_Protect#?</a>-funktiot vaikuttavat vain tietojen lukuun ja kirjoitukseen. Se, ett&auml; jokainen suojatun sivun k&auml;ytt&ouml;yritys (sivun koko on t&auml;ll&auml; hetkell&auml; 4096 tavua) luo access fault -poikkeuksen, vaikka suojattu alue olisi vain 1 tavun mittainen, hidastaa huomattavasti ohjelman suoritusta. Erityisesti, jos koodin osia on samalla sivulla. Jos ohjelma riippuu suoritusnopeudesta, se voi toimia eri tavoin. Siksi tietyt ohjelmat eiv&auml;t ehk&auml; toimi resload_Protect-ominaisuuden kanssa.<h4>Esimerkki: koodin tarkistussummat</h4>Jos asennat pelin WHDLoadilla sinun on p&auml;ivitett&auml;v&auml; pelin alkuper&auml;iset latausrutiinit niin, ett&auml; ne lataavat pelitiedot WHDLoadilla. Jotkut pelit laskevat tarkastussummia koodialueista tunnistaakseen, onko alkuper&auml;ist&auml; koodia muutettu. N&auml;it&auml; tunnistusrutiineja voi joskus olla vaikea l&ouml;yt&auml;&auml;. WHDLoadin <a
href="../autodoc.html">resload_Protect#?</a>-funktiolla se on kuitenkin helppoa. Suojaa vain pelikoodissa muuttamasi tavut lukemiselta. Nyt jokainen tarkistussummaa laskeva rutiini, joka lukee p&auml;ivitetty&auml; koodia synnytt&auml;&auml; access fault -poikkeuksen. Nin tied&auml;t, miss&auml; rutiini sijaitsee.<h4>Rajoitukset</h4>Et voi suojata muistia, jonne SSP osoittaa. Jos teet niin ja tulee poikkeus, seurauksena on Double Bus Fault -virhe, koska suoritin ei voi kirjoittaa poikkeuksen pinokehyst&auml;. Double Bus Faultin j&auml;lkeen suoritusta voidaan jatkaa vain resetoimalla. WHDLoad tarkistaa suojatun alueen ja SSP:n ristiriidan ja keskeytyy, jos ehto t&auml;yttyy. Siit&auml; ei ole apua, jos SSP muuttuu my&ouml;hemmin.<p>Lis&auml;tietoa rajoituksista sek&auml; muuta tietoa on eri resload_Protect-funktioiden Autodoc-ohjeissa:<ul>
<li><a href="../autodoc.html#resload_ProtectRead">resload_ProtectRead</a><li><a href="../autodoc.html#resload_ProtectReadWrite">resload_ProtectReadWrite</a><li><a href="../autodoc.html#resload_ProtectRemove">resload_ProtectRemove</a><li><a href="../autodoc.html#resload_ProtectSMC">resload_ProtectSMC</a><li><a href="../autodoc.html#resload_ProtectWrite">resload_ProtectWrite</a></ul>
</BODY>
</HTML>
