<HTML>
<HEAD>
<TITLE>Kontakt</TITLE>
<meta name="DC.Language" content="dk">
<meta http-equiv="content-language" content="dk">
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
<!-- $Id: author.html 1.4 2017/04/06 23:34:18 wepl Exp wepl $ -->
</HEAD>
<BODY>
<h4><a name="Contact">Kontakt</a></h4>
<table cellpadding=5>
<tr><td>
Elektronisk mail
</td><td>
<a href="mailto:wepl@whdload.de">wepl@whdload.de</a>
<td></tr><tr><td>
Hjemmeside
</td><td>
<a href="http://www.whdload.de/wepl/">http://www.whdload.de/wepl/</a>
<td></tr><tr><td>
WHDLoad hjemmeside
</td><td>
<a href="http://www.whdload.de/">http://www.whdload.de/</a>
<td></tr><tr><td valign=top>
Post addresse
</td><td>
<address>
Bert Jahn<br>
Samuel-Heinicke-Straﬂe 13<br>
Zwickau<br>
08058<BR>
Germany
</address>
</td></tr>
</table>
<h4>Sidste ord</h4>
Her er lidt mere information om mig og historien bag WHDLoad.<br>I l&oslash;bet
af min skoletid st&oslash;dte jeg f&oslash;rste gang p&aring; elektronik. Min bror, som er
flere &aring;r &aelig;ldre end mig, har bygget forskellige ting hermed. Dette imponerede
mig meget og jeg begyndte at g&oslash;re det samme. Jeg byggede (eller pr&oslash;vede at bygge)
forskellige elektriske apparater begyndende med nogle blinkende LED'er over
forst&aelig;rkere og mere. Senere blev computere mere popul&aelig;re og jeg havde adgang
til en maskine kaldet KC85. Jeg &oslash;nskede at jeg havde min egen computer, men
dette var, af forskellige grunde, ikke muligt p&aring; dav&aelig;rende tidspunkt. S&aring; jeg
startede med at bygge en computer ud fra konstruktions manualen der var trykt
i et tysk magasin kaldet Funkamateur. I denne periode var der politiske
&aelig;ndringer i Tyskland some gjorde den for&aelig;ldet, og jeg stoppede med at arbejde
p&aring; den. Jeg fik en gammel CBM 3032 maskine fra en ven og begyndte at programmere
den. F&oslash;rst i Basic og senere i maskinkode (af hensyn til fart). Jeg skrev et
lille Backgammon program og et hurtigt spil over livet (Cromwell) simulator.
Omkring 1990 k&oslash;bte jeg min f&oslash;rste Amiga, en A500. Jeg havde meget sjov med
mine f&oslash;rste spil: Corporation og RoboCop2. I l&oslash;bet af denne tid brugte jeg mest
min Amiga til spil. Senere startede jeg med at programmere i assembler. Jeg
skrev nogle sm&aring; v&aelig;rkt&oslash;jer, hvoraf WRip nok er det mest kendte af dem. I julen
1994 kodede jeg de f&oslash;rste byte af WHDLoad. Grunden var Cannon Fodder 2, som
var umuligt at spille fra floppy disk. Jeg havde tidligere set en harddisk
installation af Agony og var virkelig imponeret. Jeg undrede mig over hvordan
dette virkede. Spillet k&oslash;rte ikke under operativ systemet men installationen
hentede filerne fra harddisken. Efter at have kigget mere p&aring; det forstod jeg
det, og begyndte at skrive noget lignende til CF2. Koden l&aring; l&aelig;nge ur&oslash;rt p&aring; min
harddisk. I februar 1996 rodede jeg med det igen. Jeg havde en ide til et
program som indeholder alt det tekniske til at degradere og skifte OS, sammenlignet
med en mappe. Og en anden del (slaven) som som skulle indeholde det specifikke
indhold som programmet skal installere. Og s&aring;ledes blev WHDLoad f&oslash;dt. Jeg
arbejdede j&aelig;vnligt med WHDLoad. Jeg skrev installationer til Gods og Chaos Engine,
og i August 1996 blev den f&oslash;rste offentlige version af WHDLoad (0.43) uploadet til
Aminet. Jeg fik ikke meget respons p&aring; den, men fortsatte med at arbejde p&aring; WHDLoad.
Jeg implementerede flere features og fjernede fejl. I starten af 1997 lavede jeg
den f&oslash;rste WWW side til WHDLoad. I April 1997 kontaktede de f&oslash;rste folk mig, som
var interesseret i at skrive installationer vha. WHDLoad. Det var Harry og Mr Larmer.
Dette var et meget lykkeligt &oslash;jeblik for mig. Over tid voksede WHDLoad projektet endnu
mere. Flere features, bedre kompatibilitet og en masse nye installationer programmeret
af forskellige folk.
<br>idag er WHDLoad meget stabil og har en masse features. Det har taget en masse
arbejde og tid at skrive, teste og rette fejl. Jeg tror ikke mange folk kan forestille
sig det - specielt fordi mange dele af WHDLoad ikke kan debugges. Da jeg startede med
at bede om et registrerings bel&oslash;b med WHDLoad version 1.0 pr&oslash;vede jeg at f&aring; noget
p&aring;sk&oslash;nnelse og support for min arbejdsindsats. Jeg har ogs&aring; planlagt at dele dette
bel&oslash;b med andre forfattere af WHDLoad installationer, men dette afh&aelig;nger af antallet
af registreringer.
<br>Jeg h&aring;ber at ogs&aring; du vil st&oslash;tte den fremtidige udvikling af WHDLoad og nye
installationer. Hj&aelig;lp til at dr&oslash;mmen om at der en dag ikke l&aelig;ngere vil v&aelig;re et spil
der er n&oslash;dt til at ligge p&aring; en floppy disk fordi der ikke er nogen install for det
vil komme til virkelighed...
</BODY>
</HTML>
