<HTML>
<HEAD>
<TITLE>Krav</TITLE>
<meta name="DC.Language" content="dk">
<meta http-equiv="content-language" content="dk">
<meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
<!-- $Id: need.html 1.3 2012/10/06 17:36:49 wepl Exp wepl $ -->
</HEAD>
<BODY>
<h3>Krav</h3>
<h4>... til at k&oslash;re installerede programmer</h4>
<ul>
<li>CPU 68000 (68010+ anbefales fordi nogle installs beh&oslash;ver VBR'en for
'quit by a key' featuren)
<li>Kickstart 2.0 (version 37+)
<li>minimum 1.0 MB RAM (nogle gange mere, det afh&aelig;nger af det installerede program)
</ul>
<h5>Kickstart Emulation</h5>
<p>Nogle installs bruger en s&aring;kaldt <cite>kickemu</cite> for at have et komplet AmigaOS
milj&oslash; til det installerede program. Til denne <cite>kickemu</cite> er et originalt
kickstart image n&oslash;dvendigt. Dette image kan udtr&aelig;kkes fra en rigtig Amiga med v&aelig;rkt&oslash;jer
s&aring;som <cite>GrabKick</cite> eller et lignende som kan findes p&aring;
aminet (Vær sikker på at du har et <a href="bugs.html">korrekt setup af dine diske
(MaxTransfer, Mask)</a> ellers vil det frembragte image kunne være i stykker). Den underst&oslash;ttede
image version afh&aelig;nger af det installerede program.
Du skulle kunne finde information om hvilket image der skal bruges i den medf&oslash;lgende
<i>ReadMe</i> fil. Imaget til kickstart versionerne 1.2 og 1.3 kan kun blive udtrukket
fra en A500, for version 3.1 kan den tr&aelig;kkes ud fra en A500/A600/A2000, A1200 eller A4000
som skal v&aelig;re udstyret med en Kick3.1 ROM. Hvis ikke WHDLoad kan finde imaget eller imaget
er den forkerte version eller &aelig;ndret p&aring; nogen m&aring;de vil WHDLOad stoppe med en passende fejl
besked. Derudover skal en relocation fil med endelsen <tt>.RTB</tt> der matcher kickstart
imaget forefindes. Denne reloactions fil kan findes p&aring; aminet i arkivet
<a href="http://www.aminet.net/util/boot/skick346.lha">util/boot/skick346.lha</a>.
Begge filer, kickstart imaget og relocation filen, skal findes i folderen <i>Devs:Kickstarts/</i> og
skal have det korrekte navn. Startende fra WHDLoad version 17.0 kan filerne også blive
placeret i folderen <i>WHDCOMMON:</i>. Den f&oslash;lgende tabel viser navnene
p&aring; de filer der afh&aelig;nger af kickstart verionen:</p>

Fra WHDLoad version 16.5 er det ogs&aring; muligt at bruge kickstart imagene fra Cloanto Amiga
Forever CD'erne. Imagene skal omd&oslash;bes i overensstemmelse med tabellen
herunder. Derudover skal <i>rom.key'en</i> kopieres til
<i>Devs:Kickstarts/</i> eller <i>WHDCOMMON:</i>. Nogle &aelig;ldre installationer kr&aelig;ver ogs&aring; et
kick40068.A1200 image. Disse installs vil ikke virke med Cloantos ROMene.<br>
Amiga Forever 2008 indeholder også kick40068.A1200 og images bliver
automatisk kopieret til de rigtigge steder.<br> Amiga Forever 2011 inkluderer også
kick33180.A500 og kick40063.A600 roms. Disse roms kræver WHDLoad version
17.0 for at virke.<p>

<table border=1 cellpadding=3><tr>
	<th rowspan=2>Version</th>
	<th rowspan=2>Navn Kickstart Image</th>
	<th rowspan=2>Navn Relocation File</th>
	<th rowspan=3>Cloanto 'Amiga Forever' fil navne</th>
</tr><tr>
	<th>release 3.0</th>
	<th>release 2005</th>
	<th>release 2011</th>
</tr><tr>
	<td align=center>1.2</td>
	<td>Devs:Kickstarts/kick33180.A500</td>
	<td>Devs:Kickstarts/kick33180.A500.RTB</td>
	<td></td>
	<td></td>
	<td>amiga-os-120.rom</td>
</tr><tr>
	<td align=center>1.3</td>
	<td>Devs:Kickstarts/kick34005.A500</td>
	<td>Devs:Kickstarts/kick34005.A500.RTB</td>
	<td>kick130.rom</td>
	<td>amiga-os-130.rom</td>
	<td>amiga-os-130.rom</td>
</tr><tr>
	<td align=center rowspan=3>3.1</td>
	<td>Devs:Kickstarts/kick40063.A600</td>
	<td>Devs:Kickstarts/kick40063.A600.RTB</td>
	<td></td>
	<td></td>
	<td>amiga-os-310-a500.rom</td>
</tr><tr>
	<td>Devs:Kickstarts/kick40068.A1200</td>
	<td>Devs:Kickstarts/kick40068.A1200.RTB</td>
	<td></td>
	<td></td>
	<td>amiga-os-310-a1200.rom</td>
</tr><tr>
	<td>Devs:Kickstarts/kick40068.A4000</td>
	<td>Devs:Kickstarts/kick40068.A4000.RTB</td>
	<td>kick310.rom</td>
	<td>amiga-os-310.rom</td>
	<td>amiga-os-310.rom</td>
</tr></table>

<h4>... for at skrive nye Slaves / installations programmer</h4>
<ul>
<li>en 68030+ anbefales for at bruge alle WHDLoads features (en stor maskine
er altid et godt valg til at udvikle software ;-))
<li>viden om maskin kode, assembler amiga hardware...
<li>en assembler (b&oslash;r v&aelig;re mulig at optimere)
<li>andre v&aelig;rkt&oslash;jer vil v&aelig;re nyttige (hexedit, disasm, ...)
<li>nogle flere MB RAM
<li>adgang til forskellige maskiner af test &aring;rsager (68000 - 68060, OCS, AGA,
GfxCard)
<li>en hardware eller software Freezer s&aring;som AR3, HRTMon, TK
<li>en NMI knap til at stoppe et k&oslash;rende program eller f&aring; adgang til en
software-monitor/freezer
</ul>
</BODY>
</HTML>
