<HTML>
<HEAD>
<TITLE>Kiíratás</TITLE>
<meta name="DC.Language" content="hu">
<meta http-equiv="content-language" content="hu">
<meta http-equiv="content-type" content="text/html; charset=iso-8859-2">
<!-- $Id: dump.html 1.4 2009/02/05 20:38:15 wepl Exp wepl $ -->
</HEAD>
<BODY>
<h3>WHDLoad kiíratásai és naplófájljai</h3>
Elsõsorban hibakeresési célból a WHDLoad különbözõ kiíratási és naplófájlokat tud
létrehozni.
<h4><a name="memory">Memória kiíratás</a></h4>
A memória kiíratás az a memóriaterület egy fájlba mentve, amelyet az installált program használ.
A kiíratás mérete függ az installált programtól (megegyezik a Slave struktúra <a href="../autodoc.html#ws_BaseMemSize">ws_BaseMemSize</a>
értékével). A memória kiíratást létre lehet hozni a <a href="opt.html#DebugKey">Hibakeresõ</a>
billentyû lenyomásával vagy egy hiba után a CoreDump gomb megnyomásával. A memórai
kiíratás fájl neve ".whdl_memory" lesz. Az alapértelmezett helye a "PROGDIR:", de ez
megváltoztatható a <a href="opt.html#CoreDumpPath">CoreDumpPath</a> opcióval. Ha van már
ilyen nevû fájl, akkor az felül lesz írva. Ha az installált program további memóriát is
használ, az a ".whdl_expmem" néven lesz lementve.
<h4><a name="register">Regiszter kiíratás</a></h4>
<p>A regiszter kiíratás a CPU (beleértve az MMU-t is) tartalmazza, a Cia és a Custom chipek
  állapotát tartalmazza. Néhány Cia és Custom regiszter nem olvasható, ezeket csak akkor
  tartalmazza a kiíratott fájl, ha a <a href="opt.html#Snoop">Figyelõ</a> mód aktív volt.
  Az információk egy ASCII fájlba lesznek kiírva néhány kiemelés használatával, amely Escape
  szekvenciák segítségével történeik (CSI - Control Sequence Introducer, decimális 155,
  használatával). A megtekintéséhez olyan program ajánlott, amely támogatja az Escape
  szekvenciákat (pl. More, MuchMore, MultiView, ...). A kiíratás fájl neve ".whdl_register"
  lesz, az alapértelmezett helye a "PROGDIR:", de ez a <a href="opt.html#CoreDumppath">CoreDumpPath</a>
  opcióval megváltoztatható. Ha van már ilyen nevû fájl, a kiíratás hozzá lesz fûzve - egyébként egy új fájl
  lesz létrehozva.</p>
<h4><a name="complete" id="complete">Eg&eacute;sz fájl ki&iacute;rat&aacute;s</a></h4>
<p>Az eg&eacute;sz f&aacute;jl ki&iacute;rat&aacute;s egy IFF f&aacute;jl lesz ameylik az eg&eacute;sz informaci&oacute;kat az el&ouml;bbi ki&iacute;rat&aacute;soktol megtartozza.  	A szándékoz&aacute;z az hogy m&aacute;s programmok hasn&aacute;ly&aacute;k. A szerkezet levan&iacute;rva egy k&uuml;l&ouml;n tartalmazas ba amely neve whddump.i. Mostan&aacute;ban a programmok WHDLoadGCI (graphical coders interface) &eacute;s SP (save picture) olvasnak az eg&eacute;sz ki&iacute;rat&aacute;st. Az eg&eacute;sz ki&iacute;rat&aacute;s f&aacute;jl neve &quot;.whdl_dump&quot; lesz. Az alapértelmezett helye a "PROGDIR:", de ez a CoreDumpPath opcióval megváltoztatható. Ha van már ilyen nevû fájl, a kiíratás f&aacute;jl mindig fel&uuml;l&iacute;rva lesz.</p>
<h4><a name="FileLog">Fájl hozzáférési napló</a></h4>
Minden lemezhozzáférés naplózva lesz ha a <a href="opt.html#FileLog">Fájlnapló</a> opció
be van kapcsolva. Ez a lehetõség hasznos az installált rpogram lemezmûveleteinek
elemzéséhez hibakeresési és optimizálási céllal. A következõ resload funkciók lesznek
feljegyezve a naplófájlban:
<ul>
<li><a href="../autodoc.html#resload_DeleteFile">resload_DeleteFile</a>
<li><a href="../autodoc.html#resload_DiskLoad">resload_DiskLoad</a>
<li><a href="../autodoc.html#resload_Examine">resload_Examine</a>
<li><a href="../autodoc.html#resload_ExNext">resload_ExNext</a>
<li><a href="../autodoc.html#resload_GetFileSize">resload_GetFileSize</a>
<li><a href="../autodoc.html#resload_GetFileSizeDec">resload_GetFileSizeDec</a>
<li><a href="../autodoc.html#resload_ListFiles">resload_ListFiles</a>
<li><a href="../autodoc.html#resload_LoadFile">resload_LoadFile</a>
<li><a href="../autodoc.html#resload_LoadFileDecrunch">resload_LoadFileDecrunch</a>
<li><a href="../autodoc.html#resload_LoadFileOffset">resload_LoadFileOffset</a>
<li><a href="../autodoc.html#resload_SaveFile">resload_SaveFile</a>
<li><a href="../autodoc.html#resload_SaveFileOffset">resload_SaveFileOffset</a>
</ul>
Ezeken a funkciókon keresztüli minden fájl-hozzáférés egy sort hoz létre az
naplóban, amely a funkciót, a crct az olvasott/&igrave;rt adatoknak, a paramétereket és az eredményt rögzíti. A WHDLoad
egy belsõ pufferbe gyûjti a naplóbejegyzéseket. A puffer törlõdni fog kilépésnél vagy
ha teli lesz. Az információk egy ASCII fájlba lesznek kiírva, a fájl neve
".whdl_filelog" lesz, az alapértelmezett helye a "PROGDIR:" de ez
megváltoztatható a <a href="opt.html#CoreDumppath">CoreDumpPath</a> opcióval.
</BODY>
</HTML>
